<?xml version="1.0" ?>
<net name="ssdlite_mobiledet" version="11">
	<layers>
		<layer id="0" name="normalized_input_image_tensor" type="Parameter" version="opset1">
			<data shape="1,320,320,3" element_type="f32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="normalized_input_image_tensor"/>
				<attribute name="old_api_map_order" version="0" value="0, 2, 3, 1"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="normalized_input_image_tensor,normalized_input_image_tensor:0">
					<dim>1</dim>
					<dim>320</dim>
					<dim>320</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="normalized_input_image_tensor/Transpose([0 3 1 2])/value2765837174" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="0" size="32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="normalized_input_image_tensor/Transpose([0 3 1 2])/value2765837174"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="normalized_input_image_tensor/Transpose([0 3 1 2])" type="Transpose" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="normalized_input_image_tensor/Transpose([0 3 1 2])"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>320</dim>
					<dim>320</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Gather_2628" type="Const" version="opset1">
			<data element_type="f32" shape="16, 3, 3, 3" offset="32" size="1728"/>
			<output>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="FeatureExtractor/MobileDetCPU/Conv/Conv2D" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="FeatureExtractor/MobileDetCPU/Conv/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="data_add_20945" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="1760" size="64"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="data_add_20945"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="FeatureExtractor/MobileDetCPU/Conv/BatchNorm/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="FeatureExtractor/MobileDetCPU/Conv/BatchNorm/FusedBatchNormV3/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="FeatureExtractor/MobileDetCPU/Conv/BatchNorm/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="FeatureExtractor/MobileDetCPU/Conv/swish6/mul_1" type="HSwish" version="opset4">
			<rt_info>
				<attribute name="fused_names" version="0" value="FeatureExtractor/MobileDetCPU/Conv/swish6/mul_1"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="FeatureExtractor/MobileDetCPU/Conv/swish6/mul_1:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="FeatureExtractor/MobileDetCPU/IBNNoExpansion/SeparableConv2d/BatchNorm/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="16, 1, 1, 3, 3" offset="1824" size="576"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="FeatureExtractor/MobileDetCPU/IBNNoExpansion/SeparableConv2d/BatchNorm/FusedBatchNormV3/mean/Fused_Mul__copy"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="FeatureExtractor/MobileDetCPU/IBNNoExpansion/SeparableConv2d/depthwise_weights/read:0">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="FeatureExtractor/MobileDetCPU/IBNNoExpansion/SeparableConv2d/depthwise" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="0, 0" pads_end="0, 0" dilations="1, 1" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="FeatureExtractor/MobileDetCPU/IBNNoExpansion/SeparableConv2d/depthwise"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="data_add_2094820953" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="2400" size="64"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="data_add_2094820953"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="FeatureExtractor/MobileDetCPU/IBNNoExpansion/SeparableConv2d/BatchNorm/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="FeatureExtractor/MobileDetCPU/IBNNoExpansion/SeparableConv2d/BatchNorm/FusedBatchNormV3/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="FeatureExtractor/MobileDetCPU/IBNNoExpansion/SeparableConv2d/BatchNorm/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="FeatureExtractor/MobileDetCPU/IBNNoExpansion/SeparableConv2d/swish6/mul_1" type="HSwish" version="opset4">
			<rt_info>
				<attribute name="fused_names" version="0" value="FeatureExtractor/MobileDetCPU/IBNNoExpansion/SeparableConv2d/swish6/mul_1"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="FeatureExtractor/MobileDetCPU/IBNNoExpansion/SeparableConv2d/swish6/mul_1:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="FeatureExtractor/MobileDetCPU/IBNNoExpansion/SqueezeExcite/AvgPool2D/AvgPool" type="AvgPool" version="opset1">
			<data kernel="160, 160" strides="1, 1" pads_begin="0, 0" pads_end="0, 0" exclude-pad="true" auto_pad="valid" rounding_type="floor"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="FeatureExtractor/MobileDetCPU/IBNNoExpansion/SqueezeExcite/AvgPool2D/AvgPool"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="FeatureExtractor/MobileDetCPU/IBNNoExpansion/SqueezeExcite/AvgPool2D/AvgPool:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="FeatureExtractor/MobileDetCPU/IBNNoExpansion/SqueezeExcite/Conv/weights/read" type="Const" version="opset1">
			<data element_type="f32" shape="8, 16, 1, 1" offset="2464" size="512"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="FeatureExtractor/MobileDetCPU/IBNNoExpansion/SqueezeExcite/Conv/weights/read"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="FeatureExtractor/MobileDetCPU/IBNNoExpansion/SqueezeExcite/Conv/weights/read:0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="FeatureExtractor/MobileDetCPU/IBNNoExpansion/SqueezeExcite/Conv/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="FeatureExtractor/MobileDetCPU/IBNNoExpansion/SqueezeExcite/Conv/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="FeatureExtractor/MobileDetCPU/IBNNoExpansion/SqueezeExcite/Conv/Conv2D:0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="FeatureExtractor/MobileDetCPU/IBNNoExpansion/SqueezeExcite/Conv/biases/read" type="Const" version="opset1">
			<data element_type="f32" shape="1, 8, 1, 1" offset="2976" size="32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="FeatureExtractor/MobileDetCPU/IBNNoExpansion/SqueezeExcite/Conv/biases/read"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="FeatureExtractor/MobileDetCPU/IBNNoExpansion/SqueezeExcite/Conv/biases/read:0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="FeatureExtractor/MobileDetCPU/IBNNoExpansion/SqueezeExcite/Conv/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="FeatureExtractor/MobileDetCPU/IBNNoExpansion/SqueezeExcite/Conv/BiasAdd/Add"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="FeatureExtractor/MobileDetCPU/IBNNoExpansion/SqueezeExcite/Conv/BiasAdd:0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="FeatureExtractor/MobileDetCPU/IBNNoExpansion/SqueezeExcite/Conv/swish6/mul_1" type="HSwish" version="opset4">
			<rt_info>
				<attribute name="fused_names" version="0" value="FeatureExtractor/MobileDetCPU/IBNNoExpansion/SqueezeExcite/Conv/swish6/mul_1"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="FeatureExtractor/MobileDetCPU/IBNNoExpansion/SqueezeExcite/Conv/swish6/mul_1:0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="FeatureExtractor/MobileDetCPU/IBNNoExpansion/SqueezeExcite/Conv_1/weights/read" type="Const" version="opset1">
			<data element_type="f32" shape="16, 8, 1, 1" offset="3008" size="512"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="FeatureExtractor/MobileDetCPU/IBNNoExpansion/SqueezeExcite/Conv_1/weights/read"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="FeatureExtractor/MobileDetCPU/IBNNoExpansion/SqueezeExcite/Conv_1/weights/read:0">
					<dim>16</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="FeatureExtractor/MobileDetCPU/IBNNoExpansion/SqueezeExcite/Conv_1/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="FeatureExtractor/MobileDetCPU/IBNNoExpansion/SqueezeExcite/Conv_1/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="FeatureExtractor/MobileDetCPU/IBNNoExpansion/SqueezeExcite/Conv_1/Conv2D:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="FeatureExtractor/MobileDetCPU/IBNNoExpansion/SqueezeExcite/Conv_1/biases/read" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="3520" size="64"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="FeatureExtractor/MobileDetCPU/IBNNoExpansion/SqueezeExcite/Conv_1/biases/read"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="FeatureExtractor/MobileDetCPU/IBNNoExpansion/SqueezeExcite/Conv_1/biases/read:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="FeatureExtractor/MobileDetCPU/IBNNoExpansion/SqueezeExcite/Conv_1/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="FeatureExtractor/MobileDetCPU/IBNNoExpansion/SqueezeExcite/Conv_1/BiasAdd/Add"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="FeatureExtractor/MobileDetCPU/IBNNoExpansion/SqueezeExcite/Conv_1/BiasAdd:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="FeatureExtractor/MobileDetCPU/IBNNoExpansion/SqueezeExcite/Conv_1/Sigmoid" type="Sigmoid" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="FeatureExtractor/MobileDetCPU/IBNNoExpansion/SqueezeExcite/Conv_1/Sigmoid"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="FeatureExtractor/MobileDetCPU/IBNNoExpansion/SqueezeExcite/Conv_1/Sigmoid:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="FeatureExtractor/MobileDetCPU/IBNNoExpansion/SqueezeExcite/mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="FeatureExtractor/MobileDetCPU/IBNNoExpansion/SqueezeExcite/mul"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="FeatureExtractor/MobileDetCPU/IBNNoExpansion/SqueezeExcite/mul:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="FeatureExtractor/MobileDetCPU/IBNNoExpansion/Conv/BatchNorm/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="8, 16, 1, 1" offset="3584" size="512"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="FeatureExtractor/MobileDetCPU/IBNNoExpansion/Conv/BatchNorm/FusedBatchNormV3/mean/Fused_Mul__copy"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="FeatureExtractor/MobileDetCPU/IBNNoExpansion/Conv/weights/read:0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="FeatureExtractor/MobileDetCPU/IBNNoExpansion/Conv/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="FeatureExtractor/MobileDetCPU/IBNNoExpansion/Conv/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="data_add_2095620961" type="Const" version="opset1">
			<data element_type="f32" shape="1, 8, 1, 1" offset="4096" size="32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="data_add_2095620961"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="FeatureExtractor/MobileDetCPU/IBNNoExpansion/Conv/BatchNorm/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="FeatureExtractor/MobileDetCPU/IBNNoExpansion/Conv/BatchNorm/FusedBatchNormV3/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="FeatureExtractor/MobileDetCPU/IBNNoExpansion/Conv/BatchNorm/FusedBatchNormV3:0,FeatureExtractor/MobileDetCPU/IBNNoExpansion/Conv/Identity:0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="FeatureExtractor/MobileDetCPU/IBN/Conv/BatchNorm/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="32, 8, 1, 1" offset="4128" size="1024"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="FeatureExtractor/MobileDetCPU/IBN/Conv/BatchNorm/FusedBatchNormV3/mean/Fused_Mul__copy"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="FeatureExtractor/MobileDetCPU/IBN/Conv/weights/read:0">
					<dim>32</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="FeatureExtractor/MobileDetCPU/IBN/Conv/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="FeatureExtractor/MobileDetCPU/IBN/Conv/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="data_add_2096420969" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="5152" size="128"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="data_add_2096420969"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="FeatureExtractor/MobileDetCPU/IBN/Conv/BatchNorm/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="FeatureExtractor/MobileDetCPU/IBN/Conv/BatchNorm/FusedBatchNormV3/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="FeatureExtractor/MobileDetCPU/IBN/Conv/BatchNorm/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="FeatureExtractor/MobileDetCPU/IBN/Conv/swish6/mul_1" type="HSwish" version="opset4">
			<rt_info>
				<attribute name="fused_names" version="0" value="FeatureExtractor/MobileDetCPU/IBN/Conv/swish6/mul_1"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="FeatureExtractor/MobileDetCPU/IBN/Conv/swish6/mul_1:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="FeatureExtractor/MobileDetCPU/IBN/SeparableConv2d/BatchNorm/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="32, 1, 1, 3, 3" offset="5280" size="1152"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="FeatureExtractor/MobileDetCPU/IBN/SeparableConv2d/BatchNorm/FusedBatchNormV3/mean/Fused_Mul__copy"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="FeatureExtractor/MobileDetCPU/IBN/SeparableConv2d/depthwise_weights/read:0">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="FeatureExtractor/MobileDetCPU/IBN/SeparableConv2d/depthwise" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="0, 0" pads_end="0, 0" dilations="1, 1" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="FeatureExtractor/MobileDetCPU/IBN/SeparableConv2d/depthwise"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="data_add_2097220977" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="6432" size="128"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="data_add_2097220977"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="FeatureExtractor/MobileDetCPU/IBN/SeparableConv2d/BatchNorm/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="FeatureExtractor/MobileDetCPU/IBN/SeparableConv2d/BatchNorm/FusedBatchNormV3/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="FeatureExtractor/MobileDetCPU/IBN/SeparableConv2d/BatchNorm/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="FeatureExtractor/MobileDetCPU/IBN/SeparableConv2d/swish6/mul_1" type="HSwish" version="opset4">
			<rt_info>
				<attribute name="fused_names" version="0" value="FeatureExtractor/MobileDetCPU/IBN/SeparableConv2d/swish6/mul_1"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="FeatureExtractor/MobileDetCPU/IBN/SeparableConv2d/swish6/mul_1:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="FeatureExtractor/MobileDetCPU/IBN/SqueezeExcite/AvgPool2D/AvgPool" type="AvgPool" version="opset1">
			<data kernel="80, 80" strides="1, 1" pads_begin="0, 0" pads_end="0, 0" exclude-pad="true" auto_pad="valid" rounding_type="floor"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="FeatureExtractor/MobileDetCPU/IBN/SqueezeExcite/AvgPool2D/AvgPool"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="FeatureExtractor/MobileDetCPU/IBN/SqueezeExcite/AvgPool2D/AvgPool:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="FeatureExtractor/MobileDetCPU/IBN/SqueezeExcite/Conv/weights/read" type="Const" version="opset1">
			<data element_type="f32" shape="8, 32, 1, 1" offset="6560" size="1024"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="FeatureExtractor/MobileDetCPU/IBN/SqueezeExcite/Conv/weights/read"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="FeatureExtractor/MobileDetCPU/IBN/SqueezeExcite/Conv/weights/read:0">
					<dim>8</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="FeatureExtractor/MobileDetCPU/IBN/SqueezeExcite/Conv/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="FeatureExtractor/MobileDetCPU/IBN/SqueezeExcite/Conv/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="FeatureExtractor/MobileDetCPU/IBN/SqueezeExcite/Conv/Conv2D:0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="FeatureExtractor/MobileDetCPU/IBN/SqueezeExcite/Conv/biases/read" type="Const" version="opset1">
			<data element_type="f32" shape="1, 8, 1, 1" offset="7584" size="32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="FeatureExtractor/MobileDetCPU/IBN/SqueezeExcite/Conv/biases/read"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="FeatureExtractor/MobileDetCPU/IBN/SqueezeExcite/Conv/biases/read:0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="FeatureExtractor/MobileDetCPU/IBN/SqueezeExcite/Conv/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="FeatureExtractor/MobileDetCPU/IBN/SqueezeExcite/Conv/BiasAdd/Add"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="FeatureExtractor/MobileDetCPU/IBN/SqueezeExcite/Conv/BiasAdd:0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="FeatureExtractor/MobileDetCPU/IBN/SqueezeExcite/Conv/swish6/mul_1" type="HSwish" version="opset4">
			<rt_info>
				<attribute name="fused_names" version="0" value="FeatureExtractor/MobileDetCPU/IBN/SqueezeExcite/Conv/swish6/mul_1"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="FeatureExtractor/MobileDetCPU/IBN/SqueezeExcite/Conv/swish6/mul_1:0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="FeatureExtractor/MobileDetCPU/IBN/SqueezeExcite/Conv_1/weights/read" type="Const" version="opset1">
			<data element_type="f32" shape="32, 8, 1, 1" offset="7616" size="1024"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="FeatureExtractor/MobileDetCPU/IBN/SqueezeExcite/Conv_1/weights/read"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="FeatureExtractor/MobileDetCPU/IBN/SqueezeExcite/Conv_1/weights/read:0">
					<dim>32</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="FeatureExtractor/MobileDetCPU/IBN/SqueezeExcite/Conv_1/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="FeatureExtractor/MobileDetCPU/IBN/SqueezeExcite/Conv_1/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="FeatureExtractor/MobileDetCPU/IBN/SqueezeExcite/Conv_1/Conv2D:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="FeatureExtractor/MobileDetCPU/IBN/SqueezeExcite/Conv_1/biases/read" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="8640" size="128"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="FeatureExtractor/MobileDetCPU/IBN/SqueezeExcite/Conv_1/biases/read"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="FeatureExtractor/MobileDetCPU/IBN/SqueezeExcite/Conv_1/biases/read:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="FeatureExtractor/MobileDetCPU/IBN/SqueezeExcite/Conv_1/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="FeatureExtractor/MobileDetCPU/IBN/SqueezeExcite/Conv_1/BiasAdd/Add"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="FeatureExtractor/MobileDetCPU/IBN/SqueezeExcite/Conv_1/BiasAdd:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="FeatureExtractor/MobileDetCPU/IBN/SqueezeExcite/Conv_1/Sigmoid" type="Sigmoid" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="FeatureExtractor/MobileDetCPU/IBN/SqueezeExcite/Conv_1/Sigmoid"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="FeatureExtractor/MobileDetCPU/IBN/SqueezeExcite/Conv_1/Sigmoid:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="FeatureExtractor/MobileDetCPU/IBN/SqueezeExcite/mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="FeatureExtractor/MobileDetCPU/IBN/SqueezeExcite/mul"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="FeatureExtractor/MobileDetCPU/IBN/SqueezeExcite/mul:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="FeatureExtractor/MobileDetCPU/IBN/Conv_1/BatchNorm/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="16, 32, 1, 1" offset="8768" size="2048"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="FeatureExtractor/MobileDetCPU/IBN/Conv_1/BatchNorm/FusedBatchNormV3/mean/Fused_Mul__copy"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="FeatureExtractor/MobileDetCPU/IBN/Conv_1/weights/read:0">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="FeatureExtractor/MobileDetCPU/IBN/Conv_1/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="FeatureExtractor/MobileDetCPU/IBN/Conv_1/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="data_add_2098020985" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="10816" size="64"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="data_add_2098020985"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="FeatureExtractor/MobileDetCPU/IBN/Conv_1/BatchNorm/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="FeatureExtractor/MobileDetCPU/IBN/Conv_1/BatchNorm/FusedBatchNormV3/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="FeatureExtractor/MobileDetCPU/IBN/Conv_1/BatchNorm/FusedBatchNormV3:0,FeatureExtractor/MobileDetCPU/IBN/Conv_1/Identity:0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="FeatureExtractor/MobileDetCPU/IBN_1/Conv/BatchNorm/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="128, 16, 1, 1" offset="10880" size="8192"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="FeatureExtractor/MobileDetCPU/IBN_1/Conv/BatchNorm/FusedBatchNormV3/mean/Fused_Mul__copy"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="FeatureExtractor/MobileDetCPU/IBN_1/Conv/weights/read:0">
					<dim>128</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="FeatureExtractor/MobileDetCPU/IBN_1/Conv/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="FeatureExtractor/MobileDetCPU/IBN_1/Conv/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="data_add_2098820993" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1, 1" offset="19072" size="512"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="data_add_2098820993"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="FeatureExtractor/MobileDetCPU/IBN_1/Conv/BatchNorm/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="FeatureExtractor/MobileDetCPU/IBN_1/Conv/BatchNorm/FusedBatchNormV3/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="FeatureExtractor/MobileDetCPU/IBN_1/Conv/BatchNorm/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="FeatureExtractor/MobileDetCPU/IBN_1/Conv/swish6/mul_1" type="HSwish" version="opset4">
			<rt_info>
				<attribute name="fused_names" version="0" value="FeatureExtractor/MobileDetCPU/IBN_1/Conv/swish6/mul_1"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="FeatureExtractor/MobileDetCPU/IBN_1/Conv/swish6/mul_1:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="FeatureExtractor/MobileDetCPU/IBN_1/SeparableConv2d/BatchNorm/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="128, 1, 1, 3, 3" offset="19584" size="4608"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="FeatureExtractor/MobileDetCPU/IBN_1/SeparableConv2d/BatchNorm/FusedBatchNormV3/mean/Fused_Mul__copy"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="FeatureExtractor/MobileDetCPU/IBN_1/SeparableConv2d/depthwise_weights/read:0">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="FeatureExtractor/MobileDetCPU/IBN_1/SeparableConv2d/depthwise" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="0, 0" pads_end="0, 0" dilations="1, 1" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="FeatureExtractor/MobileDetCPU/IBN_1/SeparableConv2d/depthwise"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="data_add_2099621001" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1, 1" offset="24192" size="512"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="data_add_2099621001"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="FeatureExtractor/MobileDetCPU/IBN_1/SeparableConv2d/BatchNorm/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="FeatureExtractor/MobileDetCPU/IBN_1/SeparableConv2d/BatchNorm/FusedBatchNormV3/variance/Fused_Add_"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="FeatureExtractor/MobileDetCPU/IBN_1/SeparableConv2d/BatchNorm/FusedBatchNormV3:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="FeatureExtractor/MobileDetCPU/IBN_1/SeparableConv2d/swish6/mul_1" type="HSwish" version="opset4">
			<rt_info>
				<attribute name="fused_names" version="0" value="FeatureExtractor/MobileDetCPU/IBN_1/SeparableConv2d/swish6/mul_1"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="FeatureExtractor/MobileDetCPU/IBN_1/SeparableConv2d/swish6/mul_1:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="FeatureExtractor/MobileDetCPU/IBN_1/SqueezeExcite/AvgPool2D/AvgPool" type="AvgPool" version="opset1">
			<data kernel="40, 40" strides="1, 1" pads_begin="0, 0" pads_end="0, 0" exclude-pad="true" auto_pad="valid" rounding_type="floor"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="FeatureExtractor/MobileDetCPU/IBN_1/SqueezeExcite/AvgPool2D/AvgPool"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="FeatureExtractor/MobileDetCPU/IBN_1/SqueezeExcite/AvgPool2D/AvgPool:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="FeatureExtractor/MobileDetCPU/IBN_1/SqueezeExcite/Conv/weights/read" type="Const" version="opset1">
			<data element_type="f32" shape="32, 128, 1, 1" offset="24704" size="16384"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="FeatureExtractor/MobileDetCPU/IBN_1/SqueezeExcite/Conv/weights/read"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="FeatureExtractor/MobileDetCPU/IBN_1/SqueezeExcite/Conv/weights/read:0">
					<dim>32</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="FeatureExtractor/MobileDetCPU/IBN_1/SqueezeExcite/Conv/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="FeatureExtractor/MobileDetCPU/IBN_1/SqueezeExcite/Conv/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="FeatureExtractor/MobileDetCPU/IBN_1/SqueezeExcite/Conv/Conv2D:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="FeatureExtractor/MobileDetCPU/IBN_1/SqueezeExcite/Conv/biases/read" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="41088" size="128"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="FeatureExtractor/MobileDetCPU/IBN_1/SqueezeExcite/Conv/biases/read"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="FeatureExtractor/MobileDetCPU/IBN_1/SqueezeExcite/Conv/biases/read:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="FeatureExtractor/MobileDetCPU/IBN_1/SqueezeExcite/Conv/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="FeatureExtractor/MobileDetCPU/IBN_1/SqueezeExcite/Conv/BiasAdd/Add"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="FeatureExtractor/MobileDetCPU/IBN_1/SqueezeExcite/Conv/BiasAdd:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="FeatureExtractor/MobileDetCPU/IBN_1/SqueezeExcite/Conv/swish6/mul_1" type="HSwish" version="opset4">
			<rt_info>
				<attribute name="fused_names" version="0" value="FeatureExtractor/MobileDetCPU/IBN_1/SqueezeExcite/Conv/swish6/mul_1"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="FeatureExtractor/MobileDetCPU/IBN_1/SqueezeExcite/Conv/swish6/mul_1:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="FeatureExtractor/MobileDetCPU/IBN_1/SqueezeExcite/Conv_1/weights/read" type="Const" version="opset1">
			<data element_type="f32" shape="128, 32, 1, 1" offset="41216" size="16384"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="FeatureExtractor/MobileDetCPU/IBN_1/SqueezeExcite/Conv_1/weights/read"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="FeatureExtractor/MobileDetCPU/IBN_1/SqueezeExcite/Conv_1/weights/read:0">
					<dim>128</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="FeatureExtractor/MobileDetCPU/IBN_1/SqueezeExcite/Conv_1/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="FeatureExtractor/MobileDetCPU/IBN_1/SqueezeExcite/Conv_1/Conv2D"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="FeatureExtractor/MobileDetCPU/IBN_1/SqueezeExcite/Conv_1/Conv2D:0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="FeatureExtractor/MobileDetCPU/IBN_1/SqueezeExcite/Conv_1/biases/read" type="Const" version="opset1">
